package tv.codealong.tutorials.various.yandex.test6_3_real;

/**
 * Вы — backend-разработчик в интернет-магазине.
 * Дела идут в гору и магазин решил повысить лояльность покупателей, предоставляя им персональные скидки.
 * К вам обратился product owner с задачей создать простую систему лояльности,
 * которая предоставляет процентную скидку на корзину.
 * Размер скидки зависит от покупателя.
 * Аналитики уже определили, какие скидки должны быть предоставлены покупателям.
 * <p>
 * <p>
 * ## Определения
 * <p>
 * Корзина - список покупок покупателя.
 * <p>
 * Покупка:
 * - id товара
 * - цена
 * - итоговая стоимость c учетом скидки
 * <p>
 * Скидка. Для покупателя может быть задан % скидки (целое число).
 * <p>
 * <p>
 * ## Задача
 * Написать часть новой системы лояльности, которая:
 * - на вход получает id покупателя и корзину
 * - вычисляет и применяет скидки
 * - возвращает корзину, в которой учтены скидки. Скидка учитывается в стоимости покупки
 */
public class LoyaltySystem {
}
